/* In browser window title */
"Get a registration key!" = "Registreerimata";

/* The full name of the supporter */
"Registered to {0}" = "Registreeritud kasutajale {0}";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Täname sind toetuse eest! Sinu panus võimaldab meil Cuberducki veelgi paremaks teha.";

/* Copy of donation key */
"Your registration key has been copied to the Application Support folder." = "Sinu registreerumisvõti kopeeriti rakenduse toe kausta.";

/* Validation failed */
"Not a valid registration key" = "Pole korrektne registreerumisvõti";

"This registration key does not appear to be valid." = "See registreerumisvõti ei näi olevat korrektne.";

/* Thank you */
"Continue" = "Jätka";
